nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/src/system/fmac_event.c
	dst = (struct nrf_wifi_rpu_debug_stats *)fmac_dev_ctx->debug_stats;
	if (dst) {
		nrf_wifi_osal_mem_cpy(dst, &ev->stats, sizeof(ev->stats));
	}
	fmac_dev_ctx->debug_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}


static enum nrf_wifi_status umac_event_sys_umac_int_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct umac_int_stats *ev = event;
	struct umac_int_stats *dst;

	if (!event) {
		nrf_wifi_osal_log_err("%s: Invalid parameters", __func__);
		goto out;
	}

	if (!fmac_dev_ctx->umac_int_stats_req) {
		nrf_wifi_osal_log_dbg("%s: UMAC int stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	dst = (struct umac_int_stats *)fmac_dev_ctx->umac_int_stats;
	if (dst) {
		nrf_wifi_osal_mem_cpy(dst, ev, sizeof(*ev));
	}
	fmac_dev_ctx->umac_int_stats_req = false;
	status = NRF_WIFI_STATUS_SUCCESS;

out:
	return status;
}
#endif /* NRF71_UTIL */


static enum nrf_wifi_status umac_event_sys_proc_events(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						       struct host_rpu_msg *rpu_msg)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	unsigned char *sys_head = NULL;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;

	if (!fmac_dev_ctx || !rpu_msg) {
		return status;
	}


	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	sys_head = (unsigned char *)rpu_msg->msg;

	switch (((struct nrf_wifi_sys_head *)sys_head)->cmd_event) {
	case NRF_WIFI_EVENT_STATS:
		status = umac_event_sys_stats_process(fmac_dev_ctx,
						      sys_head);
		break;
	case NRF_WIFI_EVENT_INIT_DONE:
		fmac_dev_ctx->fw_init_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	case NRF_WIFI_EVENT_DEINIT_DONE:
		fmac_dev_ctx->fw_deinit_done = 1;
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#ifdef NRF71_RAW_DATA_TX
	case NRF_WIFI_EVENT_RAW_TX_DONE:
		status = nrf_wifi_fmac_rawtx_done_event_process(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_tx_done *)sys_head);
		break;
#endif
#ifdef NRF71_SYSTEM_WITH_RAW_MODES
	case NRF_WIFI_EVENT_MODE_SET_DONE:
		status = nrf_wifi_fmac_if_mode_set_event_proc(fmac_dev_ctx,
						(struct nrf_wifi_event_raw_config_mode *)sys_head);
		break;
#endif
#if defined(NRF71_RAW_DATA_TX) || defined(NRF71_RAW_DATA_RX)
	case NRF_WIFI_EVENT_CHANNEL_SET_DONE:
		struct nrf_wifi_event_set_channel *channel_event;

		channel_event = (struct nrf_wifi_event_set_channel *)sys_head;
		if (!channel_event->status) {
			sys_dev_ctx->vif_ctx[channel_event->if_index]->channel =
			channel_event->chan.primary_num;
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#endif /* NRF71_RAW_DATA_TX */
#if defined(NRF71_RAW_DATA_RX) || defined(NRF71_PROMISC_DATA_RX)
	case NRF_WIFI_EVENT_FILTER_SET_DONE:
		struct nrf_wifi_event_raw_config_filter *filter_event;

		filter_event = (struct nrf_wifi_event_raw_config_filter *)sys_head;
		if (!filter_event->status) {
			sys_dev_ctx->vif_ctx[filter_event->if_index]->packet_filter =
								filter_event->filter;
		}
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
#endif /* NRF71_RAW_DATA_RX || NRF71_PROMISC_DATA_RX */
	case NRF_WIFI_EVENT_DEBUG_STATS:
#ifdef NRF71_UTIL
		status = umac_event_sys_debug_stats_process(fmac_dev_ctx,
							    sys_head);
#else
		nrf_wifi_osal_log_dbg("%s: Debug stats received", __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
#endif
		break;
	case NRF_WIFI_EVENT_INT_UMAC_STATS:
#ifdef NRF71_UTIL
		status = umac_event_sys_umac_int_stats_process(fmac_dev_ctx,
							       sys_head);
#else
		nrf_wifi_osal_log_dbg("%s: UMAC int stats received", __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
#endif
		break;
	case NRF_WIFI_EVENT_ERROR_STATS: {
		struct nrf_wifi_umac_event_error_stats *err_ev =
			(struct nrf_wifi_umac_event_error_stats *)sys_head;

		nrf_wifi_osal_log_info("%s: Error stats event: stats_type=%d status_code=%u",
				       __func__,
				       err_ev->stats_type,
				       err_ev->status_code);
		status = NRF_WIFI_STATUS_SUCCESS;
		break;
	}
	default:
		nrf_wifi_osal_log_err("%s: Unknown event recd: %d",
				      __func__,
				      ((struct nrf_wifi_sys_head *)sys_head)->cmd_event);
		break;
	}
	return status;
}


static enum nrf_wifi_status
nrf_wifi_fmac_data_event_process(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
				 void *umac_head)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_SUCCESS;
	int event = -1;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	if (!fmac_dev_ctx) {
		goto out;
	}

	if (!umac_head) {
		nrf_wifi_osal_log_err("%s: Invalid parameters",
				      __func__);
		goto out;
	}

	event = ((struct nrf_wifi_umac_head *)umac_head)->cmd;

#ifdef NRF_WIFI_CMD_EVENT_LOG
	nrf_wifi_osal_log_info("%s: Event %d received from UMAC",
			      __func__,
			      event);
#else
	nrf_wifi_osal_log_dbg("%s: Event %d received from UMAC",
			      __func__,
			      event);
#endif /* NRF_WIFI_CMD_EVENT_LOG */

	switch (event) {
	case NRF_WIFI_CMD_RX_BUFF:
#ifdef NRF71_RX_DONE_WQ_ENABLED
		struct nrf_wifi_rx_buff *config = nrf_wifi_osal_mem_zalloc(
			sizeof(struct nrf_wifi_rx_buff));
		if (!config) {
			nrf_wifi_osal_log_err("%s: Failed to allocate memory (RX)",
					      __func__);
			status = NRF_WIFI_STATUS_FAIL;
			break;
		}
		nrf_wifi_osal_mem_cpy(config,
				      umac_head,
				      sizeof(struct nrf_wifi_rx_buff));
		status = nrf_wifi_utils_q_enqueue(sys_dev_ctx->rx_config.rx_tasklet_event_q,
						  config);
		if (status != NRF_WIFI_STATUS_SUCCESS) {
			nrf_wifi_osal_log_err("%s: Failed to enqueue RX buffer",
					      __func__);
			nrf_wifi_osal_mem_free(config);
			break;
		}
		nrf_wifi_osal_tasklet_schedule(sys_dev_ctx->rx_tasklet);
#else
		status = nrf_wifi_fmac_rx_event_process(fmac_dev_ctx,
							umac_head);
#endif /* NRF71_RX_DONE_WQ_ENABLED */
		break;
#ifdef NRF71_DATA_TX
	case NRF_WIFI_CMD_TX_BUFF_DONE:
#ifdef NRF71_TX_DONE_WQ_ENABLED
		struct nrf_wifi_tx_buff_done *config = nrf_wifi_osal_mem_zalloc(
					sizeof(struct nrf_wifi_tx_buff_done));
		if (!config) {
			nrf_wifi_osal_log_err("%s: Failed to allocate memory (TX)",
					      __func__);
			status = NRF_WIFI_STATUS_FAIL;
			break;
		}
		nrf_wifi_osal_mem_cpy(config,
				      umac_head,
				      sizeof(struct nrf_wifi_tx_buff_done));
		status = nrf_wifi_utils_q_enqueue(sys_dev_ctx->tx_config.tx_done_tasklet_event_q,
						  config);
		if (status != NRF_WIFI_STATUS_SUCCESS) {
			nrf_wifi_osal_log_err("%s: Failed to enqueue TX buffer",
					      __func__);
			nrf_wifi_osal_mem_free(config);
			break;
		}
		nrf_wifi_osal_tasklet_schedule(sys_dev_ctx->tx_done_tasklet);
#else
		status = nrf_wifi_fmac_tx_done_event_process(fmac_dev_ctx,
								umac_head);
#endif /* NRF71_TX_DONE_WQ_ENABLED */
		break;
	case NRF_WIFI_CMD_CARRIER_ON:
		status = nrf_wifi_fmac_if_carr_state_event_proc(fmac_dev_ctx,
								umac_head,
								NRF_WIFI_FMAC_IF_CARR_STATE_ON);
		break;
	case NRF_WIFI_CMD_CARRIER_OFF:
		status = nrf_wifi_fmac_if_carr_state_event_proc(fmac_dev_ctx,
								umac_head,
								NRF_WIFI_FMAC_IF_CARR_STATE_OFF);
		break;
#endif /* NRF71_DATA_TX */
#ifdef NRF71_AP_MODE
	case NRF_WIFI_CMD_PM_MODE:
		status = sap_client_update_pmmode(fmac_dev_ctx,
						  umac_head);
		break;
	case NRF_WIFI_CMD_PS_GET_FRAMES:
		status = sap_client_ps_get_frames(fmac_dev_ctx,
						  umac_head);
		break;
#endif /* NRF71_AP_MODE */
	default:
		break;
	}

out:
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		nrf_wifi_osal_log_err("%s: Failed for event = %d",
				      __func__,
				      event);
	}

